src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_Ozon_ВыгрузкаКарточек</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/ИС_Ozon_КатегорииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Ozon_КатегорииТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертифицируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type_id</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аспектная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_Ozon_ВыгрузкаКарточек/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЕстьПраваАдминистратора = Пользователи.ЭтоПолноправныйПользователь( , Истина);

//	Ozon_Константы 	= Ozon_КонстантыВызовСервера.ПрочитатьКонстанты();	

//	ИспользоватьЯндексДискДляОбменаКартинками = Ozon_Константы.ЗначенияПоИменам.ИспользоватьЯндексДискДляОбменаКартинками;
//	ВариантВыгрузкиФотографий = ?(ИспользоватьЯндексДискДляОбменаКартинками, "1", "0");
//	ЯндексДискТокенПриложения = Ozon_Константы.ЗначенияПоИменам.ЯндексДискТокенПриложения;

	//ЗаполнитьДатыАктуальностиСправочнойИнформации();

	Если ЕстьПраваАдминистратора Тогда
		ИспользоватьДополнительныеОтчетыИОбработки = ПолучитьФункциональнуюОпцию(
			"ИспользоватьДополнительныеОтчетыИОбработки");		
		//ОбновитьИнформациюПоЗаданиям();
	КонецЕсли;
	//УстановитьВидимостьДоступностьНастройкиРеглЗаданий();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьУсловноеОформление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура ВариантВыгрузкиГлавногоФотоПриИзменении(Элемент)

//	ИспользоватьЯндексДискДляОбменаКартинками = (ВариантВыгрузкиФотографий = "1");

//	Ozon_КонстантыКлиентСервер.ОбновитьЗначениеКонстанты("ИспользоватьЯндексДискДляОбменаКартинками",
//		ИспользоватьЯндексДискДляОбменаКартинками);

//	ОбновитьСостояниеАвторизацииЯндекс();
//	УстановитьУсловноеОформление();

//КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСправочниковПриИзменении(Элемент)

	//ОбновитьИспользованиеНаСервере("ОбновлениеСправочников");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКатегориТоваровСOzon(Команда)
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;

	ЗагрузитьСOzon(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗначенияХарактеристикСOzon(Команда)
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;

	ЗагрузитьСOzon(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьХарактеристикиКатегорийСOzon(Команда) 
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли;      
	
	ЗагрузитьСOzon(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВыборИспользуемыхКатегорий(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИспользуемыхКатегорий", ЭтотОбъект);

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаВыбораКатегорийТоваров", , ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьЗначенияХарактеристик(Команда)

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаСопоставленияХарактеристик", , ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьОсновныеРеквизитыТоваров(Команда)

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаСопоставленияОсновныхРеквизитов", , ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СопоставитьХарактеристикиДляВесовогоТовара(Команда)
	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаСопоставленияХарактеристикВесовогоТовара", , ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

//&НаКлиенте
//Процедура ПоказатьАктуальностьЗначенийХарактеристик(Команда)

//	ОткрытьФорму("РегистрСведений.Ozon_АктуальностьЗначенийХарактеристик.ФормаСписка", , ЭтотОбъект);

//КонецПроцедуры

&НаКлиенте
Процедура АвторизацияЯндексДиск(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияАвторизацииЯндекс", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.Ozon_АвторизацияЯндекс", , ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

//&НаКлиенте
//Процедура НастроитьРасписание_ОбновлениеСправочников(Команда)

//	Идентификатор = "ОбновлениеСправочников";

//	СтруктураНастроек = ПолучитьНастройкиПоЗаданию(Идентификатор);

//	ПараметрыВыполнения = Новый Структура("Идентификатор, ИмяКоманды, СтруктураНастроек", Идентификатор, Команда.Имя,
//		СтруктураНастроек);
//	Обработчик = Новый ОписаниеОповещения("РегламентныеЗаданияПослеИзмененияРасписания", ЭтотОбъект,
//		ПараметрыВыполнения);

//	Расписание = Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ПолучитьРасписаниеРегламентногоЗадания(
//		СтруктураНастроек.РегламентноеЗаданиеGUID);

//	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
//	Диалог.Показать(Обработчик);

//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьСOzon(ИмяКоманды)

	//ДлительнаяОперация = ЗагрузитьСOzonНаСервере(ИмяКоманды); 

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяКоманды", ИмяКоманды);
	//Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияЗагрузкиСOzon", ЭтотОбъект, ДопПараметры);

	//ПараметрыОжидания = БСП_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.ВыводитьСообщения = Истина;

	//БСП_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);   
	
	ДлительнаяОперация = ЗагрузитьСOzonНаСервере(ИмяКоманды); 
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗавершенияЗагрузкиСOzon", ЭтотОбъект, ДопПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания());

КонецПроцедуры

&НаСервере
Функция ЗагрузитьСOzonНаСервере(ИмяКоманды) 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);

	Если ИмяКоманды = "ЗагрузитьКатегориТоваровСOzon" Тогда		
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ИС_Ozon_Сервер.ЗагрузитьКатегорииТоваров",
		Аккаунт);
		
	ИначеЕсли ИмяКоманды = "ЗагрузитьХарактеристикиКатегорийСOzon" Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ИС_Ozon_Сервер.ЗагрузитьХарактеристикиКатегорий",
		Аккаунт);
		
	ИначеЕсли ИмяКоманды = "ЗагрузитьЗначенияХарактеристикСOzon" Тогда		
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ИС_Ozon_Сервер.ЗагрузитьЗначенияХарактеристик",
		Аккаунт, Неопределено, Неопределено, ЗагружатьЗначенияНеобязательныхХарактеристик);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//&НаСервере
//Процедура ЗаполнитьДатыАктуальностиСправочнойИнформации()

//	ДатыАктуальности = РегистрыСведений.Ozon_ДатыАктуальностиСправочнойИнформации.ДатыАктуальности();

//	ДатаАктуальностиКатегорийТоваров 		= ДатыАктуальности.Получить(
//		Перечисления.Ozon_ОбновляемыеСправочники.КатегорииТоваров);
//	ДатаАктуальностиХарактеристик 			= ДатыАктуальности.Получить(
//		Перечисления.Ozon_ОбновляемыеСправочники.Характеристики);
//	
//	//ДатаАктуальностиЗначенийХарактеристик 	= РегистрыСведений.Ozon_АктуальностьЗначенийХарактеристик.Актуальность();

//КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОформление(ИзменилисьИспользуемыеКатегории = Ложь)

	ЕстьИспользуемыеКатегории = ЕстьИспользуемыеКатегории();
	Если ЕстьИспользуемыеКатегории() Тогда
		РезультатВыбораИспользуемыхКатегорий = 2;
		ВыбранныеКатегорииТоваров = "";
	Иначе
		РезультатВыбораИспользуемыхКатегорий = 1;
		ВыбранныеКатегорииТоваров = "Не выбраны категории!";
	КонецЕсли;

	//Если ЗначениеЗаполнено(ДатаАктуальностиКатегорийТоваров) Тогда
	//	РезультатЗагрузкиКатегорийТоваров = 2;
	//	Элементы.ВыборИспользуемыхКатегорий.Доступность 			= Истина;
	//	Элементы.ЗагрузитьХарактеристикиКатегорийСOzon.Доступность 	= ЕстьИспользуемыеКатегории;
	//Иначе
	//	РезультатЗагрузкиКатегорийТоваров = 1;
	//	Элементы.ВыборИспользуемыхКатегорий.Доступность 			= Ложь;
	//	Элементы.ЗагрузитьХарактеристикиКатегорийСOzon.Доступность 	= Ложь;
	//КонецЕсли;

	//Если ЕстьИспользуемыеКатегории И ЗначениеЗаполнено(ДатаАктуальностиКатегорийТоваров)
	//	И ДатаАктуальностиХарактеристик >= ДатаАктуальностиКатегорийТоваров И Не ИзменилисьИспользуемыеКатегории Тогда
	//	РезультатЗагрузкиХарактеристик = 2;
	//	Элементы.ЗагрузитьЗначенияХарактеристикСOzon.Доступность = Истина;
	//Иначе
	//	РезультатЗагрузкиХарактеристик = 1;
	//	Элементы.ЗагрузитьЗначенияХарактеристикСOzon.Доступность = Ложь;
	//КонецЕсли;

	//Если ЕстьИспользуемыеКатегории И ЗначениеЗаполнено(ДатаАктуальностиКатегорийТоваров) И ЗначениеЗаполнено(
	//	ДатаАктуальностиХарактеристик) 
	//	//И ДатаАктуальностиЗначенийХарактеристик >= ДатаАктуальностиКатегорийТоваров
	//	//И ДатаАктуальностиЗначенийХарактеристик >= ДатаАктуальностиХарактеристик

	//	И Не ИзменилисьИспользуемыеКатегории Тогда
	//	//РезультатЗагрузкиЗначенийХарактеристик = 2;
	//	Элементы.СопоставитьЗначенияХарактеристик.Доступность = Истина;
	//Иначе
	//	//РезультатЗагрузкиЗначенийХарактеристик = 1;
	//	Элементы.СопоставитьЗначенияХарактеристик.Доступность = Ложь;
	//КонецЕсли;

	//Элементы.ГруппаНастройкиЯндексДиск.Видимость = ИспользоватьЯндексДискДляОбменаКартинками;
	//Если ИспользоватьЯндексДискДляОбменаКартинками Тогда
	//	ОбновитьСостояниеАвторизацииЯндекс();
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЗагрузкиСOzon(Результат, СтруктураПараметров) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	//Если Результат.Статус = "Выполнено" Тогда
	//	ЗаполнитьДатыАктуальностиСправочнойИнформации();
	//ИначеЕсли Результат.Статус = "Ошибка" Тогда

	//КонецЕсли;

	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИспользуемыхКатегорий(Результат, СтруктураПараметров) Экспорт

	Если Результат = Истина Тогда
		ПоказатьПредупреждение( , "После изменения используемых категорий товаров необходимо загрузить характеристики и значения характеристик для новых категорий!",
			, "Предупреждение.");
		УстановитьУсловноеОформление(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИспользуемыеКатегории()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИС_Ozon_КатегорииТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИС_Ozon_КатегорииТоваров КАК ИС_Ozon_КатегорииТоваров
	|ГДЕ
	|	ИС_Ozon_КатегорииТоваров.Используется = ИСТИНА
	|	И НЕ ИС_Ozon_КатегорииТоваров.ПометкаУдаления
	|	И НЕ ИС_Ozon_КатегорииТоваров.ЭтоГруппа";

	РезультатЗапроса = Запрос.Выполнить();

	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

//&НаКлиенте
//Процедура ПослеЗавершенияАвторизацииЯндекс(Результат, СтруктураПараметров) Экспорт

//	ОбновитьСостояниеАвторизацииЯндекс();
//	УстановитьУсловноеОформление();

//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьСостояниеАвторизацииЯндекс()

//	ПараметрыОбмена = Ozon_ЯндексAPIВызовСервера.ПараметрыОбменаСЯндексДиск();
//	
//	//Проверяем заполненность токена

//	ТекстАвторизации = "";
//	Если Не ЗначениеЗаполнено(ПараметрыОбмена.КлючАвторизации) Тогда
//		ТекстАвторизации = "Авторизация не выполнена";
//		Возврат;
//	КонецЕсли;
//	
//	//Проверяем свойства аккаунта
//	СтруктураРезультата = Ozon_ИнтернетЗапросыВызовСервера.СтруктураРезультатаЗапроса("ЯндексДиск.ПроверкаАвторизации");
//	Ozon_ЯндексAPIВызовСервера.СвойстваАккаунта(СтруктураРезультата, ПараметрыОбмена);

//	Если СтруктураРезультата.ВыполненоУспешно Тогда
//		ТекстАвторизации = "Авторизация пройдена";
//	Иначе
//		ТекстАвторизации = "Авторизация не пройдена";
//	КонецЕсли;

//	Элементы.Декорация_НастройкиЯндексДиска.Заголовок = ТекстАвторизации;
//КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТовары(Команда) 
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль!");
		Возврат;
	КонецЕсли; 

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЭтоДобавлениеТоваров", Истина);
	СтруктураПараметров.Вставить("Аккаунт", Аккаунт);

	ОткрытьФорму("Обработка.ИС_Ozon_ВыгрузкаКарточек.Форма.ФормаДобавленияТоваров", СтруктураПараметров, ЭтотОбъект);

КонецПроцедуры

#Область РаботаСРегламентнымиЗаданиями

//&НаКлиентеНаСервереБезКонтекста
//Функция СписокИспользуемыхЗаданий()
//	ИспользуемыеЗадания = Новый Массив;
//	ИспользуемыеЗадания.Добавить(ПредопределенноеЗначение(
//		"Перечисление.Ozon_ИдентификаторыРегламентныхЗаданий.ОбновлениеСправочников"));

//	Возврат ИспользуемыеЗадания;
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Функция ИменаЭлементовФормы(Идентификатор)

//	ШаблоныИмен = Новый Структура;	
//	//ШаблоныИмен.Вставить("ИмяГруппыБлока",			СтрШаблон("Группа_%1", 	Идентификатор));
//	ШаблоныИмен.Вставить("ИмяГруппыСФлагом", СтрШаблон("ГруппаИспользовать_%1", Идентификатор));
//	ШаблоныИмен.Вставить("ИмяГруппыНастройки", СтрШаблон("ГруппаНастройки_%1", Идентификатор));
//	ШаблоныИмен.Вставить("ИмяКомандыРасписания", СтрШаблон("НастроитьРасписание_%1", Идентификатор));
//	ШаблоныИмен.Вставить("ИмяГруппыСтатус", СтрШаблон("ГруппаСтатус_%1", Идентификатор));
//	ШаблоныИмен.Вставить("ИмяДекорацияСостояние", СтрШаблон("Состояние_%1", Идентификатор));
//	ШаблоныИмен.Вставить("ИмяДекорацияЗавершено", СтрШаблон("Завершено_%1", Идентификатор));

//	Возврат ШаблоныИмен;
//КонецФункции

//&НаСервере
//Процедура ОбновитьИспользованиеНаСервере(Идентификатор)

//	ИдентификаторЗадания = Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ПолучитьСсылкуНаИдентификаторЗадания(
//		Идентификатор);
//	
//	//1. Записать в регистр
//	РегистрыСведений.Ozon_НастройкиРегламентныхЗаданий.УстановитьИспользование(ИдентификаторЗадания, ,
//		ЭтотОбъект[Идентификатор]);
//	
//	//2. Обновить команды в обработке
//	Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ОбновитьКомандыВОбработкеРегламентныхЗаданий();
//	
//	//3. Обновить информацию на форме
//	ОбновитьИнформациюПоЗаданиям(ИдентификаторЗадания);
//	
//	//4. Установить доступность настройки расписания
//	УстановитьВидимостьДоступностьНастройкиРеглЗаданий();

//КонецПроцедуры

//// Выполняет получение текущих настроек регл. заданий 
////	Обновляет значения флагов на форме
////	Обновляет информацию о расписании и даные по результатам выполнения и времени последнего запуска
////
//&НаСервере
//Процедура ОбновитьИнформациюПоЗаданиям(ИдентификаторЗадания = Неопределено)

//	ТаблицаНастроек = РегистрыСведений.Ozon_НастройкиРегламентныхЗаданий.НастройкиЗаданий(ИдентификаторЗадания,
//		ПредопределенноеЗначение("Справочник.Ozon_Аккаунты.ПустаяСсылка"));

//	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда

//		ОбновитьИнформациюПоЗаданиюИзНастроек(ИдентификаторЗадания, ТаблицаНастроек);

//	Иначе
//		СписокЗаданий = СписокИспользуемыхЗаданий();
//		Для Каждого ИдентификаторЗадания Из СписокЗаданий Цикл

//			ОбновитьИнформациюПоЗаданиюИзНастроек(ИдентификаторЗадания, ТаблицаНастроек);

//		КонецЦикла;
//	КонецЕсли;

//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьИнформациюПоЗаданиюИзНастроек(ИдентификаторЗадания, Знач ТаблицаНастроек)

//	мСтрокиНастроек = ТаблицаНастроек.НайтиСтроки(Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания));

//	СтруктураНастроек = РегистрыСведений.Ozon_НастройкиРегламентныхЗаданий.СтруктураНастроек();

//	Если мСтрокиНастроек.Количество() = 1 Тогда
//		ЗаполнитьЗначенияСвойств(СтруктураНастроек, мСтрокиНастроек[0]);
//	КонецЕсли;

//	Идентификатор = XMLСтрока(ИдентификаторЗадания);
//	ЭтотОбъект[Идентификатор] = СтруктураНастроек.Использование;

//	ОбновитьНадписьКнопкиРасписания(Идентификатор, СтруктураНастроек.Использование,
//		СтруктураНастроек.РегламентноеЗаданиеGUID);
//	ОбновитьСостояниеЗадания(Идентификатор, СтруктураНастроек);

//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьСостояниеЗадания(Идентификатор, СтруктураНастроек)

//	ИменаЭлементовФормы = ИменаЭлементовФормы(Идентификатор);

//	ЭлементСостояние = Элементы[ИменаЭлементовФормы.ИмяДекорацияСостояние];
//	ЭлементЗавершено = Элементы[ИменаЭлементовФормы.ИмяДекорацияЗавершено];

//	Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.УстановитьОписаниеСостоянияРегламентногоЗадания(
//		СтруктураНастроек, ЭлементСостояние.Заголовок, ЭлементЗавершено.Заголовок);

//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьДоступностьНастройкиРеглЗаданий()
//	Элементы.Группа_РегламентыеЗадания.Видимость = ЕстьПраваАдминистратора;

//	Если ЕстьПраваАдминистратора Тогда		
//		Элементы.Группа_ОбновлениеСправочников.Доступность 			= ИспользоватьДополнительныеОтчетыИОбработки;
//		Элементы.ГруппаНастройки_ОбновлениеСправочников.Доступность = ОбновлениеСправочников;
//	КонецЕсли;

//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьНастройкиПоЗаданию(Идентификатор)
//	ИдентификаторЗадания = Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ПолучитьСсылкуНаИдентификаторЗадания(
//		Идентификатор);

//	НастройкиЗаданий = РегистрыСведений.Ozon_НастройкиРегламентныхЗаданий.НастройкиЗаданий(ИдентификаторЗадания,
//		ПредопределенноеЗначение("Справочник.Ozon_Аккаунты.ПустаяСсылка"));

//	СтруктураНастроек = РегистрыСведений.Ozon_НастройкиРегламентныхЗаданий.СтруктураНастроек();

//	Если НастройкиЗаданий.Количество() = 1 Тогда

//		ЗаполнитьЗначенияСвойств(СтруктураНастроек, НастройкиЗаданий[0]);

//	КонецЕсли;

//	Возврат СтруктураНастроек;

//КонецФункции

//&НаКлиенте
//Процедура РегламентныеЗаданияПослеИзмененияРасписания(Расписание, ПараметрыВыполнения) Экспорт

//	СтруктураНастроек = ПараметрыВыполнения.СтруктураНастроек;

//	Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ОбновитьРасписаниеРегламентногоЗадания(Расписание,
//		СтруктураНастроек.РегламентноеЗаданиеGUID);

//	ОбновитьНадписьКнопкиРасписания(ПараметрыВыполнения.Идентификатор, СтруктураНастроек.Использование,
//		СтруктураНастроек.РегламентноеЗаданиеGUID);

//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьНадписьКнопкиРасписания(Идентификатор, Использование, РегламентноеЗаданиеGUID)

//	Представление = "Настроить расписание";

//	ИменаЭлементовФормы = ИменаЭлементовФормы(Идентификатор);

//	ЭлементКнопки = Элементы[ИменаЭлементовФормы.ИмяКомандыРасписания];
//	УстановитьПривилегированныйРежим(Истина);
//	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
//	Если РегламентноеЗадание <> Неопределено Тогда
//		Расписание = Ozon_НастройкаВнешнейОбработкиРеглЗаданийВызовСервера.ПолучитьРасписаниеРегламентногоЗадания(
//			РегламентноеЗадание);

//		Если Расписание <> Неопределено И Использование И РегламентноеЗадание.Использование Тогда
//			РасписаниеПредставление = Строка(Расписание);
//			Представление = ВРег(Лев(РасписаниеПредставление, 1)) + Сред(РасписаниеПредставление, 2);
//		КонецЕсли;

//	КонецЕсли;

//	ЭлементКнопки.Заголовок = Представление;

//КонецПроцедуры

#КонецОбласти //РаботаСРегламентнымиЗаданиями 

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
&НаКлиенте
Функция ПараметрыОжидания()
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = "Идет процесс загрузки...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 5;
	ПараметрыОжидания.ПолучатьРезультат = Истина;     
	
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ИС_Ozon_ВыгрузкаКарточек";
	
	Возврат ПараметрыОжидания;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983                               

#КонецОбласти
